Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/svd/PIC32CK2051SG01144.svd
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>PWP[%s]</name>
               <description>PFM Write Protect Region 0</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWPSIZE</name>
                     <description>PWP Region 0 Size in 4KB pages</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PWPMIR</name>
                     <description>Mirror PWP 0 bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWPLOCK</name>
                     <description>PWP Region 0 Lock Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWPEN</name>
                     <description>PWP Region 0 Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWPBASE</name>
                     <description>PWP Region 0 Base Address - 4KB Page Aligned</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LBWP</name>
               <description>Lower BFM Write Protect Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>LBWP</name>
                     <description>Lower Boot Pages Write Protect Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>LBWPLOCK</name>
                     <description>LBWP Lock Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UBWP</name>
               <description>Upper BFM Write Protect Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>UBWP</name>
                     <description>Upper Boot Pages Write Protect Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>UBWPLOCK</name>
                     <description>UBWP Register Lock Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UOWP</name>
               <description>User OTP Write Protect Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000F0F</resetValue>
               <fields>
                  <field>
                     <name>UO1WP</name>
                     <description>User OTP Page 1 Write Protect Row Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UO2WP</name>
                     <description>User OTP Page 2 Write Protect Row Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UO1WPRLOCK</name>
                     <description>User OTP Page 1 WP Row Lock Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UO2WPRLOCK</name>
                     <description>User OTP Page 2 WP Row Lock Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWP</name>
               <description>CFM Page Write Protect Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000505</resetValue>
               <fields>
                  <field>
                     <name>UC1WP</name>
                     <description>User Configuration Page 1 Write Protect Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC1WP</name>
                     <description>Boot Configuration Page 1 Write Protect Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UC2WP</name>
                     <description>User Configuration Page 2 Write Protect Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC2WP</name>
                     <description>Boot Configuration Page 2 Write Protect Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UC1WPLOCK</name>
                     <description>User Configuration Page 1 WP Lock Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC1WPLOCK</name>
                     <description>Boot Configuration Page 1 WP Lock Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UC2WPLOCK</name>
                     <description>User Configuration Page 2 WP Lock Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC2WPLOCK</name>
                     <description>Boot Configuration Page 2 WP Lock Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMINTENCLR</name>
               <description>HSM NVM Interrupt Enable Clear Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMINTENSET</name>
               <description>HSM NVM Interrupt Enable SET Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMINTFLAG</name>
               <description>HSM NVM Interrupt Flag Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Flag Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Flag Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Flag Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Flag Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Flag Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Flag Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Flag Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Flag Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Flag Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Flag Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCWP</name>
               <description>HSM CFG Write Protect Register</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x0000F000</resetValue>
               <fields>
                  <field>
                     <name>HCWP</name>
                     <description>HSM CFG Page Write Protect Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>HCWPLOCK</name>
                     <description>HSMCWP Register Lock Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSMLDAT[%s]</name>
               <description>HSM Tamper Lower Overwrite Data Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSMUDAT[%s]</name>
               <description>HSM Tamper Upper Overwrite Data Register</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
            </register>
