Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/svd/PIC32CK2051SG01144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSM</name>
         <version>037851b0</version>
         <description>Hardware Security Module</description>
         <groupName>HSM</groupName>
         <prependToName>HSM_</prependToName>
         <baseAddress>0x48000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x15C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSM_ERROR</name>
            <value>155</value>
         </interrupt>
         <interrupt>
            <name>HSM_TXINT</name>
            <value>156</value>
         </interrupt>
         <interrupt>
            <name>HSM_RXINT</name>
            <value>157</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CONTROL REGISTER A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Clock Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run In Standby bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>CONTROL REGISTER B</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CANCEL</name>
                     <description>Cancel Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>INTERRUPT ENABLE CLEAR REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERROR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPER</name>
                     <description>Tamper Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>INTERRUPT ENABLE SET</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERROR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPER</name>
                     <description>Tamper Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>INTERRUPT FLAG</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERROR</name>
                     <description>Error Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPER</name>
                     <description>Tamper Interrupt Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>STATUS</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>HSM CPU BUSY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LKUP</name>
                     <description>HSM CPU LOCKUP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS</name>
                     <description>PROCESSING STATE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LCS</name>
                     <description>LIFECYCLE STATE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SBS</name>
                     <description>SECURE BOOT STATE</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ECODE</name>
                     <description>ERROR CODE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>MBFIFO[%s]</name>
               <description>MAILBOX FIFO</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MBFIFO</name>
                     <description>MAILBOX FIFO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBTXSTATUS</name>
               <description>MAILBOX TRANSMIT STATUS</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <resetValue>0x00100000</resetValue>
               <fields>
                  <field>
                     <name>TXREMAINING</name>
                     <description>TRANSMIT BYTES REMAINING</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXTYPE</name>
                     <description>TRANSMIT MESSAGE HEADER TYPE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXINT</name>
                     <description>TRANSMIT FIFO INTERRUPT FLAG</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFULL</name>
                     <description>TRANSMIT FIFO FULL</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>TRANSMIT ERROR</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBRXSTATUS</name>
               <description>MAILBOX RECEIVE STATUS</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>RXREMAINING</name>
                     <description>RECEIVE BYTES REMAINING</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RXTYPE</name>
                     <description>RECEIVE MESSAGE HEADER TYPE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RXINT</name>
                     <description>RECEIVE FIFO INTERRUPT FLAG</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEMPTY</name>
                     <description>RECEIVE FIFO FULL</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXHEAD</name>
                     <description>Receive Header Next Word bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXERR</name>
                     <description>RECEIVE ERROR</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBTXPROT</name>
               <description>MAILBOX TX PROTECTION</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UNPROT</name>
                     <description>MAILBOX UNPROTECTED</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>MAILBOX MESSAGE PRIVILEDGED ACCESS</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSEC</name>
                     <description>MAILBOX MESSAGE NON-SECURE ACCESS</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>USER SIDEBAND</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBRXPROT</name>
               <description>MAILBOX RX PROTECTION</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UNPROT</name>
                     <description>MAILBOX UNPROTECTED</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>MAILBOX MESSAGE PRIVILEDGED ACCESS</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSEC</name>
                     <description>MAILBOX MESSAGE NON-SECURE ACCESS</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>USER SIDEBAND</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBTXHEAD</name>
               <description>MAILBOX TRANSMIT HEADER</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXHEAD</name>
                     <description>MAILBOX TRANSMIT HEADER REGISTER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBRXHEAD</name>
               <description>MAILBOX RECEIVE HEADER</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXHEAD</name>
                     <description>MAILBOX RECEIVE HEADER REGISTER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBCONFIG</name>
               <description>MAILBOX CONFIGURATION</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXINT</name>
                     <description>MAILBOX TRANSMIT INTERRUPT ENABLE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXINT</name>
                     <description>MAILBOX RECEIVE INTERRUPT ENABLE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
