Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/svd/PIC32CK2051SG01144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PORT</name>
         <version>037204a0</version>
         <description>Port Module</description>
         <groupName>PORT</groupName>
         <prependToName>PORT_</prependToName>
         <baseAddress>0x44800000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PORT</name>
            <value>32</value>
         </interrupt>
         <registers>
            <cluster>
               <dim>4</dim>
               <dimIncrement>0x80</dimIncrement>
               <name>GROUP[%s]</name>
               <description/>
               <addressOffset>0x00</addressOffset>
               <register>
                  <name>DIR</name>
                  <description>Data Direction</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Port Data Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRCLR</name>
                  <description>Data Direction Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRCLR</name>
                        <description>Port Data Direction Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRSET</name>
                  <description>Data Direction Set</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRSET</name>
                        <description>Port Data Direction Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRTGL</name>
                  <description>Data Direction Toggle</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRTGL</name>
                        <description>Port Data Direction Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUT</name>
                  <description>Data Output Value</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUT</name>
                        <description>PORT Data Output Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTCLR</name>
                  <description>Data Output Value Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTCLR</name>
                        <description>PORT Data Output Value Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTSET</name>
                  <description>Data Output Value Set</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTSET</name>
                        <description>PORT Data Output Value Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTTGL</name>
                  <description>Data Output Value Toggle</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTTGL</name>
                        <description>PORT Data Output Value Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>IN</name>
                  <description>Data Input Value</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>IN</name>
                        <description>PORT Data Input Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRL</name>
                  <description>Control</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SAMPLING</name>
                        <description>Input Sampling Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WRCONFIG</name>
                  <description>Write Configuration</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PINMASK</name>
                        <description>Pin Mask for Multiple Pin Configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ODRAIN</name>
                        <description>Open Drain Output</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>PMUX</name>
                        <description>Peripheral Multiplexing</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>WRPMUX</name>
                        <description>Write PMUX</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRPINCFG</name>
                        <description>Write PINCFG</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HWSEL</name>
                        <description>Half-Word Select</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EVCTRL</name>
                  <description>Event Input Control</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PID0</name>
                        <description>PORT Event Pin Identifier 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>EVACT0</name>
                        <description>PORT Event Action 0</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVACT0Select</name>
                           <enumeratedValue>
                              <name>OUT</name>
                              <description>Event output to pin</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>Set output register of pin on event</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLR</name>
                              <description>Clear output register of pin on event</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TGL</name>
                              <description>Toggle output register of pin on event</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PORTEI0</name>
                        <description>PORT Event Input Enable 0</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PID1</name>
                        <description>PORT Event Pin Identifier 1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>EVACT1</name>
                        <description>PORT Event Action 1</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>PORTEI1</name>
                        <description>PORT Event Input Enable 1</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PID2</name>
                        <description>PORT Event Pin Identifier 2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>EVACT2</name>
                        <description>PORT Event Action 2</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>PORTEI2</name>
                        <description>PORT Event Input Enable 2</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PID3</name>
                        <description>PORT Event Pin Identifier 3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>EVACT3</name>
                        <description>PORT Event Action 3</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>PORTEI3</name>
                        <description>PORT Event Input Enable 3</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
